## HR Analytic dataset

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### Reading the data

In [2]:
df = pd.read_csv('aug_train.csv')
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [3]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [4]:
df.shape

(19158, 14)

In [5]:
df_copy = df

In [6]:
df['target'].value_counts()

0.0    14381
1.0     4777
Name: target, dtype: int64

### Initial obeservations : 
#### 1. Target coulmn is our target feature
#### 2. The data is imbalanced between the classes
#### 3. there are many mising values in the dataset
#### 4. quite moderate dataset
#### 5. Gender, relevant experience, enrolled univeristy, education level, major discipline, company type are the categorical features

### starting the FE&EDA

In [7]:
df.drop('enrollee_id', axis = 1, inplace = True)
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

### handling the gender column

In [8]:
df['gender'].value_counts()

Male      13221
Female     1238
Other       191
Name: gender, dtype: int64

In [9]:
df['gender'].unique()

array(['Male', nan, 'Female', 'Other'], dtype=object)

In [10]:
df['gender'].isnull().sum()

4508

In [11]:
### since the gender class is imbalanced before using the onehot encoding, I am creating the two categories male, and female
### nan, other are subsituted to female
df['gender'] = df['gender'].apply(lambda x : 'Male' if x == 'Male' else 'Female')

In [12]:
df['gender'].value_counts()

Male      13221
Female     5937
Name: gender, dtype: int64

In [13]:
df['gender'].isnull().sum()

0

In [14]:
### one hot encoding
gender = pd.get_dummies(df['gender'], prefix = 'gender', dtype = int)
df = pd.concat([df, gender], axis = 1)
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male
0,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,0,1
1,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1
2,city_21,0.624,Female,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0
3,city_115,0.789,Female,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0
4,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1

In [15]:
df.drop('gender', axis = 1, inplace = True)

In [16]:
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male
0,city_103,0.920,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,0,1
1,city_40,0.776,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1
2,city_21,0.624,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0
3,city_115,0.789,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0
4,city_162,0.767,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1

### handling the relevant experience column

In [17]:
df['relevent_experience'].unique()

array(['Has relevent experience', 'No relevent experience'], dtype=object)

In [18]:
df['relevent_experience'].value_counts()

Has relevent experience    13792
No relevent experience      5366
Name: relevent_experience, dtype: int64

In [19]:
### no missing value in the 'relevant experience column' so directly using the label encoding
df['relevent_experience'] = df['relevent_experience'].map({
    'Has relevent experience' : 1,
    'No relevent experience' : 0
})

In [20]:
df['relevent_experience'].value_counts()

1    13792
0     5366
Name: relevent_experience, dtype: int64

In [21]:
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male
0,city_103,0.920,1,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,0,1
1,city_40,0.776,0,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1
2,city_21,0.624,0,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0
3,city_115,0.789,0,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0
4,city_162,0.767,1,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1

### handling the enrolled_univeristy column

In [38]:
df['enrolled_university'].unique()

array(['no_enrollment', 'Full time course', nan, 'Part time course'],
      dtype=object)

In [42]:
df['enrolled_university'].value_counts()

no_enrollment       13817
Full time course     3757
Part time course     1584
Name: enrolled_university, dtype: int64

In [43]:
df['enrolled_university'].isna().sum()

0

In [41]:
df['enrolled_university'].fillna('Part time course', inplace = True)

In [44]:
### for this column I am going for the label encoding
df['enrolled_university'] = df['enrolled_university'].map({
    'no_enrollment' : 0, 'Part time course' : 1, 'Full time course' : 2
})

In [45]:
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male
0,city_103,0.920,1,0,Graduate,STEM,>20,NaN,NaN,1,36,1.0,0,1
1,city_40,0.776,0,0,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1
2,city_21,0.624,0,2,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0
3,city_115,0.789,0,1,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0
4,city_162,0.767,1,0,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1

### education level column

In [33]:
df['education_level'].unique()

array(['Graduate', 'Masters', 'High School', nan, 'Phd', 'Primary School'],
      dtype=object)

In [48]:
df['education_level'].value_counts()

Graduate          11598
Masters            4361
High School        2017
Primary School      768
Phd                 414
Name: education_level, dtype: int64

In [35]:
df['education_level'].isna().sum()

460

In [46]:
### Using the same label encoding approach with substituting the the nan with primary school
df['education_level'].fillna('Primary School', inplace = True)

In [51]:
df['education_level'].isna().sum()

0

In [52]:
df['education_level'] = df['education_level'].map({
    'Primary School' : 0, 'High School' : 1, 'Graduate' : 2, 'Masters' : 3, 'Phd' : 4
})

In [53]:
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male
0,city_103,0.920,1,0,2,STEM,>20,NaN,NaN,1,36,1.0,0,1
1,city_40,0.776,0,0,2,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1
2,city_21,0.624,0,2,2,STEM,5,NaN,NaN,never,83,0.0,1,0
3,city_115,0.789,0,1,2,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0
4,city_162,0.767,1,0,3,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1

### major discipline column

In [54]:
df['major_discipline'].unique()

array(['STEM', 'Business Degree', nan, 'Arts', 'Humanities', 'No Major',
       'Other'], dtype=object)

In [55]:
df['major_discipline'].value_counts()

STEM               14492
Humanities           669
Other                381
Business Degree      327
Arts                 253
No Major             223
Name: major_discipline, dtype: int64

In [56]:
df['major_discipline'].isna().sum()

2813

In [57]:
### for this one there may or may not be as clear relation so I will use one hot and subsituting with the 2 categories
### STEM and 'other
df['major_discipline']  = df['major_discipline'].apply(lambda x : 'STEM' if x == 'STEM' else 'Other')

In [58]:
df['major_discipline'].value_counts()

STEM     14492
Other     4666
Name: major_discipline, dtype: int64

In [59]:
major = pd.get_dummies(df['major_discipline'], dtype = int, prefix = 'major')
df = pd.concat([df, major], axis = 1)
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM
0,city_103,0.920,1,0,2,STEM,>20,NaN,NaN,1,36,1.0,0,1,0,1
1,city_40,0.776,0,0,2,STEM,15,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1
2,city_21,0.624,0,2,2,STEM,5,NaN,NaN,never,83,0.0,1,0,0,1
3,city_115,0.789,0,1,2,Other,<1,NaN,Pvt Ltd,never,52,1.0,1,0,1,0
4,city_162,0.767,1,0,3,STEM,>20,50-99,Funded Startup,4,8,0.0,0,1,0,1

In [60]:
df.drop('major_discipline', axis = 1, inplace = True)
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM
0,city_103,0.920,1,0,2,>20,NaN,NaN,1,36,1.0,0,1,0,1
1,city_40,0.776,0,0,2,15,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1
2,city_21,0.624,0,2,2,5,NaN,NaN,never,83,0.0,1,0,0,1
3,city_115,0.789,0,1,2,<1,NaN,Pvt Ltd,never,52,1.0,1,0,1,0
4,city_162,0.767,1,0,3,>20,50-99,Funded Startup,4,8,0.0,0,1,0,1

### handling the city column

In [61]:
df['city'].value_counts()

city_103    4355
city_21     2702
city_16     1533
city_114    1336
city_160     845
            ...
city_129       3
city_111       3
city_121       3
city_140       1
city_171       1
Name: city, Length: 123, dtype: int64

In [62]:
top_3 = df['city'].value_counts().head(3)

In [63]:
top_3

city_103    4355
city_21     2702
city_16     1533
Name: city, dtype: int64

In [64]:
### for city column I am again going with the one hot, as if there wwas a clear relation with something like 
### tier 1, tier 2 or tier 3 city then I would have gone for the label encoding
df['city'] = df['city'].apply(lambda x : x if x in top_3 else 'other')

In [65]:
df['city'].value_counts()

other       10568
city_103     4355
city_21      2702
city_16      1533
Name: city, dtype: int64

In [66]:
city = pd.get_dummies(df['city'], dtype = int)
df = pd.concat([df, city], axis = 1)
df.head()

,city,city_development_index,relevent_experience,enrolled_university,education_level,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM,city_103,city_16,city_21,other
0,city_103,0.920,1,0,2,>20,NaN,NaN,1,36,1.0,0,1,0,1,1,0,0,0
1,other,0.776,0,0,2,15,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1,0,0,0,1
2,city_21,0.624,0,2,2,5,NaN,NaN,never,83,0.0,1,0,0,1,0,0,1,0
3,other,0.789,0,1,2,<1,NaN,Pvt Ltd,never,52,1.0,1,0,1,0,0,0,0,1
4,other,0.767,1,0,3,>20,50-99,Funded Startup,4,8,0.0,0,1,0,1,0,0,0,1

In [67]:
df.drop(['city', 'city_16'], axis = 1, inplace = True)
df.head()

,city_development_index,relevent_experience,enrolled_university,education_level,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM,city_103,city_21,other
0,0.920,1,0,2,>20,NaN,NaN,1,36,1.0,0,1,0,1,1,0,0
1,0.776,0,0,2,15,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1,0,0,1
2,0.624,0,2,2,5,NaN,NaN,never,83,0.0,1,0,0,1,0,1,0
3,0.789,0,1,2,<1,NaN,Pvt Ltd,never,52,1.0,1,0,1,0,0,0,1
4,0.767,1,0,3,>20,50-99,Funded Startup,4,8,0.0,0,1,0,1,0,0,1

### handling the experience column

In [68]:
df['experience'].value_counts()

>20    3286
5      1430
4      1403
3      1354
6      1216
2      1127
7      1028
10      985
9       980
8       802
15      686
11      664
14      586
1       549
<1      522
16      508
12      494
13      399
17      342
19      304
18      280
20      148
Name: experience, dtype: int64

In [71]:
df.head()

,city_development_index,relevent_experience,enrolled_university,education_level,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM,city_103,city_21,other
0,0.920,1,0,2,>20,NaN,NaN,1,36,1.0,0,1,0,1,1,0,0
1,0.776,0,0,2,15,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1,0,0,1
2,0.624,0,2,2,5,NaN,NaN,never,83,0.0,1,0,0,1,0,1,0
3,0.789,0,1,2,<1,NaN,Pvt Ltd,never,52,1.0,1,0,1,0,0,0,1
4,0.767,1,0,3,>20,50-99,Funded Startup,4,8,0.0,0,1,0,1,0,0,1

In [73]:
df['experience'].fillna('20', inplace = True)

In [74]:
def clean_exp(val) : 
    if val == '<1' : 
        return 0
    elif val == '>20' : 
        return 21
    else : 
        return int(val)
    
df['experience'] = df['experience'].apply(clean_exp)

In [75]:
df['experience'] = df['experience'].astype(int)

In [76]:
### for this one I will make pool like 0-5, 6-10, 11-15 and 15+, that way then I can later apply the label encoding
def exp_level(val) : 
    if val >=0 and val < 6 : 
        return 0
    elif val >= 6 and val < 11 : 
        return 1
    elif val >= 11 and val < 16 : 
        return 2
    else : 
        return 3
    
df['experience'] = df['experience'].apply(exp_level)

In [77]:
df['experience'].value_counts()

0    6385
1    5011
3    4933
2    2829
Name: experience, dtype: int64

In [78]:
df['experience'].unique()

array([3, 2, 0, 1], dtype=int64)

In [79]:
df.head()

,city_development_index,relevent_experience,enrolled_university,education_level,experience,company_size,company_type,last_new_job,training_hours,target,gender_Female,gender_Male,major_Other,major_STEM,city_103,city_21,other
0,0.920,1,0,2,3,NaN,NaN,1,36,1.0,0,1,0,1,1,0,0
1,0.776,0,0,2,2,50-99,Pvt Ltd,>4,47,0.0,0,1,0,1,0,0,1
2,0.624,0,2,2,0,NaN,NaN,never,83,0.0,1,0,0,1,0,1,0
3,0.789,0,1,2,0,NaN,Pvt Ltd,never,52,1.0,1,0,1,0,0,0,1
4,0.767,1,0,3,3,50-99,Funded Startup,4,8,0.0,0,1,0,1,0,0,1

### company_size column